---
kind: method
id: M:Autodesk.Revit.DB.StringParameterValue.#ctor(System.String)
source: html/313bf7c6-4e4d-edf5-6e5d-562632f97a2c.htm
---
# Autodesk.Revit.DB.StringParameterValue.#ctor Method

Value constructor

## Syntax (C#)
```csharp
public StringParameterValue(
	string value
)
```

## Parameters
- **value** (`System.String`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null